БухЭксп/Reports/СверкаБанковскойВыписки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>СверкаБанковскойВыписки</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключатьОбособленныеПодразделения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательТолькоДниРасхождений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимРасшифровки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Группировка</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поле</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипГруппировки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

БухЭксп/Reports/СверкаБанковскойВыписки/Forms/ФормаОтчета/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	БухгалтерскиеОтчетыВызовСервера.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	Отчет.ПоказательТолькоДниРасхождений = Ложь;
	СформироватьОтчет = Ложь;
	
	Если ЗначениеЗаполнено(Параметры.БанковскийСчет)Тогда
		Отчет.БанковскийСчет = Параметры.БанковскийСчет;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Отчет.Организация)Тогда
		Элементы.ПолеОрганизация.РежимВыбораИзСписка = Истина;
		ПолеОрганизация = Отчет.Организация;
	КонецЕсли;
	
	Если Параметры.Свойство("Организация") Тогда
		Если ЗначениеЗаполнено(Параметры.Организация)Тогда
			Отчет.Организация = Параметры.Организация;
		КонецЕсли;
	КонецЕсли;

	Если Параметры.Свойство("НачалоПериода") Тогда
		Если ЗначениеЗаполнено(Параметры.НачалоПериода)Тогда
			Отчет.НачалоПериода = НачалоДня(Параметры.НачалоПериода);
		КонецЕсли;
	КонецЕсли;
	
	Если Параметры.Свойство("КонецПериода") Тогда
		Если ЗначениеЗаполнено(Параметры.КонецПериода)Тогда
			Отчет.КонецПериода = КонецДня(Параметры.КонецПериода);
		КонецЕсли;
	КонецЕсли;
	
	Если Параметры.Свойство("СформироватьОтчет") Тогда
		Если Параметры.СформироватьОтчет Тогда
			СформироватьОтчет = Параметры.СформироватьОтчет;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьТекстЗаголовка(ЭтаФорма);
	
	Если ОписаниеЗаданияФормированияОтчета <> Неопределено Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "ФормированиеОтчета");
		
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗагрузитьПодготовленныеДанные", ЭтотОбъект);
		
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
		
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ОписаниеЗаданияФормированияОтчета, ОповещениеОЗавершении, ПараметрыОжидания);
	
	КонецЕсли;
	
	Если СформироватьОтчет Тогда
		Подключаемый_СформироватьПриОткрытии();
	КонецЕсли;
	
	БухгалтерскиеОтчетыКлиент.ПриОткрытии(ЭтаФорма, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ВариантМодифицирован                    = Ложь;
	ПользовательскиеНастройкиМодифицированы = НЕ Отчет.РежимРасшифровки;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	БухгалтерскиеОтчетыКлиент.ПриЗакрытии(ЭтаФорма, ЗавершениеРаботы);
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииПользовательскихНастроекНаСервере(Настройки)
	
	БухгалтерскиеОтчетыВызовСервера.ПриСохраненииПользовательскихНастроекНаСервере(ЭтаФорма, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеПользовательскихНастроекНаСервере(Настройки, ИспользуютсяСтандартныеНастройки)
	
	Если Параметры.Свойство("ИспользуютсяСтандартныеНастройки") Тогда
		Если Параметры.ИспользуютсяСтандартныеНастройки Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ИспользуютсяСтандартныеНастройки Тогда
		Возврат;
	КонецЕсли;
	
	БухгалтерскиеОтчетыВызовСервера.ПриЗагрузкеПользовательскихНастроекНаСервере(ЭтаФорма, Настройки);
	
	ОбновитьТекстЗаголовка(ЭтаФорма);
	
	Если ОписаниеЗаданияФормированияОтчета = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Отчет.Организация) Тогда
		Если ЗначениеЗаполнено(Отчет.БанковскийСчет) Тогда
			Если Отчет.БанковскийСчет.Владелец <> Отчет.Организация Тогда
				Отчет.БанковскийСчет = Справочники.БанковскиеСчета.ПустаяСсылка();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "СверкаБанковскойВыписки_ПереформироватьОтчет" И Параметр = ЭтотОбъект.УникальныйИдентификатор Тогда
		 Подключаемый_СформироватьПриОткрытии();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#Область Период

&НаКлиенте
Процедура ВыбратьПериод(Команда)
	
	ПараметрыВыбора = Новый Структура("НачалоПериода,КонецПериода", Отчет.НачалоПериода, Отчет.КонецПериода);
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьПериодЗавершение", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ВыборСтандартногоПериода", ПараметрыВыбора, Элементы.ВыбратьПериод, , , , ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериодЗавершение(РезультатВыбора, ДопПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ЗаполнитьЗначенияСвойств(Отчет, РезультатВыбора, "НачалоПериода,КонецПериода");
	
	ОбновитьТекстЗаголовка(ЭтаФорма); 
	Если ОписаниеЗаданияФормированияОтчета = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НачалоПериодаПриИзменении(Элемент)
	
	ОбновитьТекстЗаголовка(ЭтаФорма);
	Если ОписаниеЗаданияФормированияОтчета = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонецПериодаПриИзменении(Элемент)
	
	ОбновитьТекстЗаголовка(ЭтаФорма);
	Если ОписаниеЗаданияФормированияОтчета = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Организация

&НаКлиенте
Процедура ПолеОрганизацияПриИзменении(Элемент)
	
	ОбщегоНазначенияБПКлиент.ПолеОрганизацияПриИзменении(Элемент, ПолеОрганизация,
		Отчет.Организация, Отчет.ВключатьОбособленныеПодразделения);
	
	ОбновитьТекстЗаголовка(ЭтаФорма);
	
	Если ОписаниеЗаданияФормированияОтчета = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	КонецЕсли;
	
	БухгалтерскиеОтчетыКлиент.ОрганизацияПриИзменении(ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеОрганизацияОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	
	Организация = Отчет.Организация;
	
	ОбщегоНазначенияБПКлиент.ПолеОрганизацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка, 
		СоответствиеОрганизаций, Отчет.Организация, Отчет.ВключатьОбособленныеПодразделения);
	
	Если Отчет.Организация <> Организация Тогда
		Отчет.БанковскийСчет = ПредопределенноеЗначение("Справочник.БанковскиеСчета.ПустаяСсылка");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеОрганизацияОткрытие(Элемент, СтандартнаяОбработка)
	
	ОбщегоНазначенияБПКлиент.ПолеОрганизацияОткрытие(Элемент, СтандартнаяОбработка,
		ПолеОрганизация, СоответствиеОрганизаций);
	
КонецПроцедуры

#КонецОбласти

#Область БанковскийСчет

&НаКлиенте
Процедура БанковскийСчетПриИзменении(Элемент)
	
	Если ОписаниеЗаданияФормированияОтчета = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	КонецЕсли;
	
	Для Каждого ЭлементОтбора Из Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") И ЭлементОтбора.Использование Тогда
			Если ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("БанковскийСчет") Тогда
				Если ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно Тогда
					ЭлементОтбора.ПравоеЗначение = Отчет.БанковскийСчет;
				Иначе
					ЭлементОтбора.ПравоеЗначение = Неопределено;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ТолькоДниРасхожденийПриИзменении(Элемент)
	
	Если ОписаниеЗаданияФормированияОтчета = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	БухгалтерскиеОтчетыКлиент.ОтборыПередНачаломДобавления(ЭтаФорма, Элемент, Отказ, Копирование, Родитель, Группа);

КонецПроцедуры

&НаКлиенте
Процедура ОтборыПередНачаломИзменения(Элемент, Отказ)
	
	БухгалтерскиеОтчетыКлиент.ОтборыПередНачаломИзменения(ЭтаФорма, Элемент, Отказ);	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборыПередУдалением(Элемент, Отказ)
	
	Отказ = Элемент.ТекущиеДанные.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборыПриИзменении(Элемент)
	
	Форма = ЭтаФорма;
	ОтчетФорма = Форма.Отчет;
	Для Каждого ЭлементОтбора Из ОтчетФорма.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		
		Если Не ЭлементОтбора.Использование Или ТипЗнч(ЭлементОтбора) <> Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Организация") Тогда
			// Отбор будет управляться настройками, а не из шапки.
			ОбновитьЗначениеОтбораПоОрганизации = Ложь;
			Если ЭлементОтбора.ВидСравнения <> ВидСравненияКомпоновкиДанных.Равно Тогда
				ОбновитьЗначениеОтбораПоОрганизации = Истина;
				ЗначениеОтбораПоОрганизации = Неопределено;
			ИначеЕсли ОтчетФорма.Организация <> ЭлементОтбора.ПравоеЗначение Тогда 
				ОбновитьЗначениеОтбораПоОрганизации = Истина;
				ЗначениеОтбораПоОрганизации = ЭлементОтбора.ПравоеЗначение;
			КонецЕсли;			
			Если ОбновитьЗначениеОтбораПоОрганизации Тогда
				// Обновляем значение, передаваемое в параметры формируемого отчета.
				ОтчетФорма.Организация = ЗначениеОтбораПоОрганизации;
				
				// Обновляем значение в шапке отчета.
				Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ПолеОрганизация")
					И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "СоответствиеОрганизаций")
					И ТипЗнч(Форма.СоответствиеОрганизаций) = Тип("Структура") Тогда
					
					Если ЗначениеЗаполнено(ЗначениеОтбораПоОрганизации) Тогда
						
						Для Каждого ЭлементСоответствия Из Форма.СоответствиеОрганизаций Цикл
							Если ЭлементСоответствия.Значение.Организация = ЭлементОтбора.ПравоеЗначение Тогда
								Форма.ПолеОрганизация = ЭлементСоответствия.Ключ;
								ОтчетФорма.Организация = ЭлементОтбора.ПравоеЗначение;
								Прервать;
							КонецЕсли;
						КонецЦикла;
						
					Иначе
						
						Форма.ПолеОрганизация = Неопределено;
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
			ОбновитьТекстЗаголовка(Форма); 
			
		ИначеЕсли ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("БанковскийСчет") Тогда
			
			ОбновитьЗначениеОтбораПоСчету = Ложь;
			Если ЭлементОтбора.ВидСравнения <> ВидСравненияКомпоновкиДанных.Равно Тогда
				ОбновитьЗначениеОтбораПоСчету = Истина;
				ЗначениеОтбораПоСчету = Неопределено;
			ИначеЕсли ОтчетФорма.БанковскийСчет <> ЭлементОтбора.ПравоеЗначение Тогда 
				ОбновитьЗначениеОтбораПоСчету = Истина;
				ЗначениеОтбораПоСчету = ЭлементОтбора.ПравоеЗначение;
			КонецЕсли;			
			Если ОбновитьЗначениеОтбораПоСчету Тогда
				// Обновляем значение, передаваемое в параметры формируемого отчета.
				ОтчетФорма.БанковскийСчет = ЗначениеОтбораПоСчету;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура МакетОформленияПриИзменении(Элемент)
	
	БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметрВывода(Отчет.КомпоновщикНастроек.Настройки, "МакетОформления", МакетОформления);
	
	Если ОписаниеЗаданияФормированияОтчета = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыводитьЗаголовокПриИзменении(Элемент)

	Если ОписаниеЗаданияФормированияОтчета = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВыводитьПодвалПриИзменении(Элемент)
	
	Если ОписаниеЗаданияФормированияОтчета = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВыводитьЕдиницуИзмеренияПриИзменении(Элемент)
	
	Если ОписаниеЗаданияФормированияОтчета = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

 &НаКлиенте
Процедура СформироватьОтчет(Команда)
	
	ОчиститьСообщения();
	ОтказПроверкиЗаполнения = Ложь;
	
	РезультатВыполнения = СформироватьОтчетНаСервере();
	РезультатВыполнения.Свойство("ОтказПроверкиЗаполнения", ОтказПроверкиЗаполнения);
	
	Если ОтказПроверкиЗаполнения = Истина Тогда
		
		ПоказатьНастройки("");
		
	Иначе
		
		Если РезультатВыполнения.Статус = "Выполняется" Тогда 
			ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "ФормированиеОтчета");
		КонецЕсли;
		
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗагрузитьПодготовленныеДанные", ЭтотОбъект);
		
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
		
		ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания);
		
		СкрытьНастройки();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьНастройки(Команда)
	
	Элементы.Сформировать.КнопкаПоУмолчанию = Истина;
	СкрытьНастройки();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьНастройки(Команда)
	Элементы.ПрименитьНастройки.КнопкаПоУмолчанию = Истина;
	ОткрытьНастройки();
КонецПроцедуры

&НаКлиенте
Процедура СохранитьКак(Команда)
	
	БухгалтерскиеОтчетыКлиент.ОтчетСохранитьКак(ЭтотОбъект);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийПоляТабличногоДокументаРезультат

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры) 
	
	СтандартнаяОбработка = Ложь;
	
	Если Элемент.ТекущаяОбласть.Текст = НСтр("ru = 'Нет данных. Загрузить'") Тогда
		ПараметрыФормы = Новый Структура;
		Расшифровка = Элемент.ТекущаяОбласть.Расшифровка;
		ИмяОбласти = Элемент.ТекущаяОбласть.Имя;
		Организация = ПараметрПриАктивизацииПоляРесурса(Расшифровка, "Организация");
		Если ЗначениеЗаполнено(Организация) Тогда
			ПараметрыФормы.Вставить("Организация", Организация);
		Иначе
			ПараметрыФормы.Вставить("Организация", ПараметрПриАктивизацииПоляРесурса(Расшифровка, "ВладелецСчета"));
		КонецЕсли;
		ПараметрыФормы.Вставить("БанковскийСчет", ПараметрПриАктивизацииПоляРесурса(Расшифровка, "БанковскийСчет"));
		ПараметрыФормы.Вставить("ДатаНачала", ДатаНетДанных(Расшифровка, ИмяОбласти, "ДатаНачала"));
		ПараметрыФормы.Вставить("ДатаОкончания", ДатаНетДанных(Расшифровка, ИмяОбласти, "ДатаОкончания"));
		ПараметрыФормы.Вставить("УИДВладельцаФормы", ЭтотОбъект.УникальныйИдентификатор);
		ОткрытьФорму("Отчет.СверкаБанковскойВыписки.Форма.ФормаЗагрузкиВыписки", ПараметрыФормы,,,,,,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		СтруктураРасшифровки = ПолучитьРасшифровку(Расшифровка, ДанныеРасшифровки);
		Если ЗначениеЗаполнено(СтруктураРасшифровки.БанковскийСчет) Тогда
			ПараметрыОтчета = Новый Структура;
			ПараметрыОтчета.Вставить("БанковскийСчет", СтруктураРасшифровки.БанковскийСчет);
			Если ЗначениеЗаполнено(СтруктураРасшифровки.Организация) Тогда
				ПараметрыОтчета.Вставить("Организация", СтруктураРасшифровки.Организация);
			Иначе
				ПараметрыОтчета.Вставить("Организация", СтруктураРасшифровки.ВладелецСчета);
			КонецЕсли;
			Если СтруктураРасшифровки.Период <> Неопределено Тогда
				ПараметрыОтчета.Вставить("НачалоПериода", СтруктураРасшифровки.Период);
				ПараметрыОтчета.Вставить("КонецПериода", КонецДня(СтруктураРасшифровки.Период));
			Иначе
				ПараметрыОтчета.Вставить("НачалоПериода", Отчет.НачалоПериода);
				ПараметрыОтчета.Вставить("КонецПериода", Отчет.КонецПериода);
			КонецЕсли;
			ПараметрыОтчета.Вставить("ТолькоДниРасхождений", Отчет.ПоказательТолькоДниРасхождений);
			
			ОткрытьФорму("Отчет.РасшифровкаБанковскойВыписки.Форма.ФормаОтчета",
				ПараметрыОтчета,, Новый УникальныйИдентификатор);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаДополнительнойРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	// Не будем обрабатывать нажатие на правую кнопку мыши.
	// Покажем стандартное контекстное меню ячейки табличного документа.
	Расшифровка = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатПриАктивизации(Элемент)
	
	БухгалтерскиеОтчетыКлиент.НачатьРасчетСуммыВыделенныхЯчеек(Элементы.Результат, ЭтотОбъект,
		"Подключаемый_РезультатПриАктивизацииПодключаемый");
	
КонецПроцедуры

&НаСервере
Функция ДатаНетДанных(Расшифровка, ИмяОбласти, РасшифровкаПериод)
	
	Расшифровка = ОпределитьРасшифровкуОбласти(ИмяОбласти, РасшифровкаПериод);
	
	Дата = ПараметрПриАктивизацииПоляРесурса(Расшифровка, "Период");
	
	Возврат Дата;
КонецФункции

&НаСервере
Функция ОпределитьРасшифровкуОбласти(ИмяОбласти, РасшифровкаПериод)
	
	ИмяОбластиНачало    = ИмяОбласти;
	ИмяОбластиДляПоиска = ИмяОбласти;
	ОбластьРезультат    = Результат.Область(ИмяОбластиНачало);
	// Для верного определения диапазона дат перебираем поля начального остатка
	// со значением "Н/Д" или "Нет данных. Загрузить".
	Пока ОбластьРезультат.Текст = НСтр("ru = 'Нет данных. Загрузить'")
			ИЛИ ОбластьРезультат.Текст = НСтр("ru = 'Н/Д'") Цикл
		ИмяОбластиДляПоиска = ИмяОбластиНачало;
		Право = ОбластьРезультат.Право;
		Если РасшифровкаПериод = "ДатаНачала" Тогда
			Направление = -1;
		Иначе
			Направление = 1;
		КонецЕсли;
		Верх = ОбластьРезультат.Верх + Направление * 3;
		ИмяОбластиНачало = "R" + Формат(Верх, "ЧГ=0") + "C" + Формат(Право, "ЧГ=0");
		ОбластьРезультат = Результат.Область(ИмяОбластиНачало);
		// Нужно проверить данные в первой колонке на наличие даты, чтобы корректно высчитать диапазон дат.
		ТекстОбластиРезультата = Результат.Область(Верх - 1, Право - 2, Верх + 1, Право - 2).Текст;
		ОбработаннаяСтрока = СтрЗаменить(ТекстОбластиРезультата, ".", "");
		Если НЕ (СтрДлина(ОбработаннаяСтрока) = 8 И СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(ОбработаннаяСтрока)) Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Расшифровка = Результат.Область(ИмяОбластиДляПоиска).Расшифровка;
	
	Возврат Расшифровка;
КонецФункции

&НаСервере
Функция ПараметрПриАктивизацииПоляРесурса(Расшифровка, Параметр)
	
	СтруктураРасшифровки = ПолучитьРасшифровку(Расшифровка, ДанныеРасшифровки);
	
	Возврат СтруктураРасшифровки[Параметр];
КонецФункции

&НаСервере
Функция ПолучитьРасшифровку(Расшифровка, ДанныеРасшифровки)
	
	ИдентификаторОбъекта = БухгалтерскиеОтчетыКлиентСервер.ИмяОтчетаПоИмениФормы(ЭтотОбъект);
	
	ПараметрыРасшифровки = Новый Структура;
	
	СтруктураРасшифровки = Отчеты[ИдентификаторОбъекта].ЗаполнитьПараметрыРасшифровкиОтчета(ДанныеРасшифровки,
		Расшифровка, ПараметрыРасшифровки);
	
	Возврат СтруктураРасшифровки;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПодготовитьПараметрыОтчетаНаСервере()
	
	ПараметрыОтчета = Новый Структура;
	ПараметрыОтчета.Вставить("Организация"                      , Отчет.Организация);
	ПараметрыОтчета.Вставить("БанковскийСчет"                   , Отчет.БанковскийСчет);
	ПараметрыОтчета.Вставить("НачалоПериода"                    , Отчет.НачалоПериода);
	ПараметрыОтчета.Вставить("КонецПериода"                     , Отчет.КонецПериода);
	ПараметрыОтчета.Вставить("ВключатьОбособленныеПодразделения", Отчет.ВключатьОбособленныеПодразделения);
	ПараметрыОтчета.Вставить("ВсеДанные"                        , Ложь);
	ПараметрыОтчета.Вставить("ПоказательТолькоДниРасхождений"   , Отчет.ПоказательТолькоДниРасхождений);
	
	ПараметрыОтчета.Вставить("РежимРасшифровки"                 , Отчет.РежимРасшифровки);
	ПараметрыОтчета.Вставить("ДанныеРасшифровки"                , ДанныеРасшифровки);
	ПараметрыОтчета.Вставить("МакетОформления"                  , МакетОформления);
	ПараметрыОтчета.Вставить("СхемаКомпоновкиДанных"            , ПолучитьИзВременногоХранилища(СхемаКомпоновкиДанных));
	ПараметрыОтчета.Вставить("ИдентификаторОтчета"              , БухгалтерскиеОтчетыКлиентСервер.ПолучитьИдентификаторОбъекта(ЭтаФорма));
	ПараметрыОтчета.Вставить("КомпоновщикНастроек"              , Отчет.КомпоновщикНастроек);
	ПараметрыОтчета.Вставить("НастройкиКомпоновкиДанных"        , Отчет.КомпоновщикНастроек.ПолучитьНастройки());
	ПараметрыОтчета.Вставить("НаборПоказателей"                 , Отчеты[ПараметрыОтчета.ИдентификаторОтчета].ПолучитьНаборПоказателей());
	ПараметрыОтчета.Вставить("ВыводитьЕдиницуИзмерения"         , ВыводитьЕдиницуИзмерения);
	ПараметрыОтчета.Вставить("Группировка"                      , Отчет.Группировка.Выгрузить());
	
	Возврат ПараметрыОтчета;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьТекстЗаголовка(Форма)
	
	Отчет = Форма.Отчет;
	
	ЗаголовокОтчета = "Сверка банковской выписки" + БухгалтерскиеОтчетыКлиентСервер.ПолучитьПредставлениеПериода(Отчет.НачалоПериода, Отчет.КонецПериода);
	
	Если ЗначениеЗаполнено(Отчет.Организация) И Форма.ИспользуетсяНесколькоОрганизаций Тогда
		ЗаголовокОтчета = ЗаголовокОтчета + " " + БухгалтерскиеОтчетыВызовСервера.ПолучитьТекстОрганизация(Отчет.Организация, Отчет.ВключатьОбособленныеПодразделения);
	КонецЕсли;
	
	Форма.Заголовок = ЗаголовокОтчета;

КонецПроцедуры

&НаКлиенте
Функция ПолучитьЗапрещенныеПоля(Режим = "") Экспорт
	
	СписокПолейГруппировки = Новый Массив;
	
	СписокПолейГруппировки.Добавить("UserFields");
	СписокПолейГруппировки.Добавить("DataParameters");
	СписокПолейГруппировки.Добавить("SystemFields");
	СписокПолейГруппировки.Добавить("Показатели");
	СписокПолейГруппировки.Добавить("Параметры");
	СписокПолейГруппировки.Добавить("Ресурсы");
	СписокПолейГруппировки.Добавить("ПоказателиВыпуска");
	СписокПолейГруппировки.Добавить("Группировки");
	СписокПолейГруппировки.Добавить("Расхождение");
	СписокПолейГруппировки.Добавить("ПредыдущийДень");
	СписокПолейГруппировки.Добавить("Подвал");
	СписокПолейГруппировки.Добавить("ПоказательПоДаннымУчета");
	СписокПолейГруппировки.Добавить("ПоказательПоДаннымБанка");
	СписокПолейГруппировки.Добавить("ПоказательРасхождение");
	СписокПолейГруппировки.Добавить("КоличествоВалют");
	СписокПолейГруппировки.Добавить("Субконто1");
	СписокПолейГруппировки.Добавить("Субконто2");
	СписокПолейГруппировки.Добавить("Субконто3");
	СписокПолейГруппировки.Добавить("НачальныйОстатокПоДаннымУчета");
	СписокПолейГруппировки.Добавить("ПоступлениеПоДаннымУчета");
	СписокПолейГруппировки.Добавить("СписаниеПоДаннымУчета");
	СписокПолейГруппировки.Добавить("КонечныйОстатокПоДаннымУчета");
	СписокПолейГруппировки.Добавить("КонечныйОстаток");
	СписокПолейГруппировки.Добавить("НачальныйОстаток");
	СписокПолейГруппировки.Добавить("Поступление");
	СписокПолейГруппировки.Добавить("Списание");
	СписокПолейГруппировки.Добавить("ИсточникЗагрузки");
	СписокПолейГруппировки.Добавить("ДанныеОбОстаткахОтсутствуют");
	СписокПолейГруппировки.Добавить("МинДата");
	СписокПолейГруппировки.Добавить("НаличиеДанныхБанка");
	СписокПолейГруппировки.Добавить("НаличиеДанныхБанкаПредыдущийДень");
	СписокПолейГруппировки.Добавить("КоличествоВалютИерархия");
	
	Если Режим = "Группировка" Тогда 
		БухгалтерскиеОтчетыКлиент.ДобавитьПоляРесурсовВЗапрещенныеПоля(ЭтаФорма, СписокПолейГруппировки);
		Возврат Новый ФиксированныйМассив(СписокПолейГруппировки);
	КонецЕсли;
	
	СписокПолейОтбора = Новый Массив;
	
	СписокПолейОтбора.Добавить("UserFields");
	СписокПолейОтбора.Добавить("DataParameters");
	СписокПолейОтбора.Добавить("SystemFields");
	СписокПолейОтбора.Добавить("Показатели");
	СписокПолейОтбора.Добавить("Параметры");
	СписокПолейОтбора.Добавить("Ресурсы");
	СписокПолейОтбора.Добавить("ПоказателиВыпуска");
	СписокПолейОтбора.Добавить("Группировки");
	СписокПолейОтбора.Добавить("Расхождение");
	СписокПолейОтбора.Добавить("ПредыдущийДень");
	СписокПолейОтбора.Добавить("Подвал");
	СписокПолейОтбора.Добавить("ПоказательПоДаннымУчета");
	СписокПолейОтбора.Добавить("ПоказательПоДаннымБанка");
	СписокПолейОтбора.Добавить("ПоказательРасхождение");
	СписокПолейОтбора.Добавить("КоличествоВалют");
	СписокПолейОтбора.Добавить("Субконто1");
	СписокПолейОтбора.Добавить("Субконто2");
	СписокПолейОтбора.Добавить("Субконто3");
	СписокПолейОтбора.Добавить("Период");
	СписокПолейОтбора.Добавить("Подразделение");
	СписокПолейОтбора.Добавить("ИсточникЗагрузки");
	СписокПолейОтбора.Добавить("ДанныеОбОстаткахОтсутствуют");
	СписокПолейОтбора.Добавить("МинДата");
	СписокПолейОтбора.Добавить("НаличиеДанныхБанка");
	СписокПолейОтбора.Добавить("НаличиеДанныхБанкаПредыдущийДень");
	СписокПолейОтбора.Добавить("КоличествоВалютИерархия");
	
	Если Режим = "Отбор" Тогда
		БухгалтерскиеОтчетыКлиент.ДобавитьПоляРесурсовВЗапрещенныеПоля(ЭтаФорма, СписокПолейОтбора);
	КонецЕсли;
	
	Возврат Новый ФиксированныйМассив(СписокПолейОтбора);
	
КонецФункции

&НаСервере
Функция СформироватьОтчетНаСервере() Экспорт
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат Новый Структура("ЗаданиеВыполнено, ОтказПроверкиЗаполнения", Истина, Истина);
	КонецЕсли;
	
	БухгалтерскиеОтчеты.ОтменитьВыполнениеЗадания(ЭтотОбъект);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеИспользовать");
	
	Настройки = Отчет.КомпоновщикНастроек.Настройки;
	Настройки.Отбор.ИдентификаторПользовательскойНастройки              = "";
	Настройки.Порядок.ИдентификаторПользовательскойНастройки            = "";
	Настройки.УсловноеОформление.ИдентификаторПользовательскойНастройки = "";
	Настройки.ДополнительныеСвойства.Вставить("ВыводитьЗаголовок", ВыводитьЗаголовок);
	Настройки.ДополнительныеСвойства.Вставить("ВыводитьПодвал"   , ВыводитьПодвал);
	
	ПараметрыОтчета = ПодготовитьПараметрыОтчетаНаСервере();
	
	ОписаниеЗаданияФормированияОтчета = БухгалтерскиеОтчеты.ЗапуститьПодготовкуОтчета(ЭтотОбъект, ПараметрыОтчета);
	
	Элементы.Сформировать.КнопкаПоУмолчанию = Истина;
	
	Возврат ОписаниеЗаданияФормированияОтчета;
	
КонецФункции

&НаКлиенте
Процедура ЗагрузитьПодготовленныеДанные(РезультатВыполнения, ДополнительныеПараметры) Экспорт

	ЗагрузитьПодготовленныеДанныеНаСервере(РезультатВыполнения);
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьПодготовленныеДанныеНаСервере(РезультатВыполнения)

	БухгалтерскиеОтчеты.ЗагрузитьПодготовленныеДанные(РезультатВыполнения, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройки()
	
	Элементы.РазделыОтчета.ТекущаяСтраница = Элементы.НастройкиОтчета;
	
КонецПроцедуры

&НаКлиенте
Процедура СкрытьНастройки()
	
	Элементы.РазделыОтчета.ТекущаяСтраница = Элементы.Отчет;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьИСформировать(ПараметрыОтчета) Экспорт
	
	Если ТипЗнч(ПараметрыОтчета) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(Отчет,ПараметрыОтчета);
		ЗаполнитьЗначенияСвойств(ЭтаФорма,ПараметрыОтчета);
	КонецЕсли;
	
	Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы.Очистить();
	Отчет.КомпоновщикНастроек.Настройки.УсловноеОформление.Элементы.Очистить();
	
	СформироватьОтчетНаСервере();
	
	ЭтаФорма.Открыть();
	
КонецПроцедуры

&НаСервере
Процедура ВычислитьСуммуВыделенныхЯчеекТабличногоДокументаВКонтекстеНаСервере()
	
	ПолеСумма = БухгалтерскиеОтчетыВызовСервера.ВычислитьСуммуВыделенныхЯчеекТабличногоДокумента(
		Результат, КэшВыделеннойОбласти);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_РезультатПриАктивизацииПодключаемый()
	
	НеобходимоВычислятьНаСервере = Ложь;
	БухгалтерскиеОтчетыКлиент.ВычислитьСуммуВыделенныхЯчеекТабличногоДокумента(
		ПолеСумма, Результат, Элементы.Результат, КэшВыделеннойОбласти, НеобходимоВычислятьНаСервере);
	
	Если НеобходимоВычислятьНаСервере Тогда
		ВычислитьСуммуВыделенныхЯчеекТабличногоДокументаВКонтекстеНаСервере();
	КонецЕсли;
	
	ОтключитьОбработчикОжидания("Подключаемый_РезультатПриАктивизацииПодключаемый");
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппировкаПриИзменении(Элемент)
	
	Если ОписаниеЗаданияФормированияОтчета = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппировкаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	БухгалтерскиеОтчетыКлиент.ГруппировкаПередНачаломДобавления(ЭтаФорма, Элемент, Отказ, Копирование, Родитель, Группа);
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппировкаПередНачаломИзменения(Элемент, Отказ)
	
	БухгалтерскиеОтчетыКлиент.ГруппировкаПередНачаломИзменения(ЭтаФорма, Элемент, Отказ);
	
КонецПроцедуры 

&НаКлиенте
Процедура ГруппировкаСнятьФлажки(Команда)
	
	Для Каждого СтрокаТаблицы Из Отчет.Группировка Цикл
		СтрокаТаблицы.Использование = Ложь;
	КонецЦикла;
	
	Если ОписаниеЗаданияФормированияОтчета = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппировкаУстановитьФлажки(Команда)
	
	Для Каждого СтрокаТаблицы Из Отчет.Группировка Цикл
		СтрокаТаблицы.Использование = Истина;
	КонецЦикла;
	
	Если ОписаниеЗаданияФормированияОтчета = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеВариантаНаСервере(Настройки)
	
	ЗаполнитьНастройкамиПоУмолчанию(Новый Структура("Показатели, Группировка", Истина, Истина)); 
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНастройкамиПоУмолчанию(ЗаполняемыеНастройки)
	
	Если ЗаполняемыеНастройки.Свойство("Группировка") И ЗаполняемыеНастройки.Группировка Тогда
		
		Отчет.Группировка.Очистить();
		
		НоваяГруппировка 				= Отчет.Группировка.Добавить();
		НоваяГруппировка.Поле 			= "Организация";
		НоваяГруппировка.Представление 	= НСтр("ru = 'Организация'");
		НоваяГруппировка.Использование 	= Истина;
		НоваяГруппировка.ТипГруппировки = 0;
		
		НоваяГруппировка 				= Отчет.Группировка.Добавить();
		НоваяГруппировка.Поле 			= "БанковскийСчет";
		НоваяГруппировка.Представление 	= НСтр("ru = 'Банковский счет'");
		НоваяГруппировка.Использование 	= Истина;
		НоваяГруппировка.ТипГруппировки = 0;
		
		НоваяГруппировка 				= Отчет.Группировка.Добавить();
		НоваяГруппировка.Поле 			= "Период";
		НоваяГруппировка.Представление 	= НСтр("ru = 'Период'");
		НоваяГруппировка.Использование 	= Истина;
		НоваяГруппировка.ТипГруппировки = 0;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СформироватьПриОткрытии()
	
	СформироватьОтчет(Команды.Найти(Элементы.Сформировать.Имя));
	
КонецПроцедуры

#КонецОбласти
